HloModule jit__lambda_, entry_computation_layout={(c128[3]{0})->(c128[3]{0}, c128[3]{0})}, allow_spmd_sharding_propagation_to_output={true,true}

%fused_computation (param_0: c128[3], param_1.2: c128[3], param_2.1: c128[]) -> c128[3] {
  %param_0 = c128[3]{0} parameter(0)
  %param_2.1 = c128[] parameter(2)
  %broadcast.67 = c128[3]{0} broadcast(c128[] %param_2.1), dimensions={}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_1.2 = c128[3]{0} parameter(1)
  %multiply.95 = c128[3]{0} multiply(c128[3]{0} %broadcast.67, c128[3]{0} %param_1.2), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %add.96 = c128[3]{0} add(c128[3]{0} %param_0, c128[3]{0} %multiply.95), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.1 (param_0.2: c128[3]) -> c128[] {
  %param_0.2 = c128[3]{0} parameter(0)
  %real.104 = f64[3]{0} real(c128[3]{0} %param_0.2), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.104 = f64[3]{0} imag(c128[3]{0} %param_0.2), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.74 = f64[3]{0} negate(f64[3]{0} %imag.104), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.72 = c128[3]{0} complex(f64[3]{0} %real.104, f64[3]{0} %negate.74), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %dot.120 = c128[] dot(c128[3]{0} %complex.72, c128[3]{0} %param_0.2), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.2 (param_0.3: c128[3], param_1.9: c128[3], param_2.8: c128[3]) -> c128[3] {
  %param_0.3 = c128[3]{0} parameter(0)
  %param_2.8 = c128[3]{0} parameter(2)
  %constant.57..sunk.3 = c128[3]{0} constant({(1.8662642516361887, -1.0711323052056121), (0.26333651876420233, -2.397191531077155), (-1.1171098790664813, 1.0158783792828929)})
  %multiply.96 = c128[3]{0} multiply(c128[3]{0} %param_2.8, c128[3]{0} %constant.57..sunk.3), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %param_1.9 = c128[3]{0} parameter(1)
  %add.97 = c128[3]{0} add(c128[3]{0} %multiply.96, c128[3]{0} %param_1.9), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add_any" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.105 = f64[3]{0} real(c128[3]{0} %add.97), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.105 = f64[3]{0} imag(c128[3]{0} %add.97), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.75 = f64[3]{0} negate(f64[3]{0} %imag.105), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.73 = c128[3]{0} complex(f64[3]{0} %real.105, f64[3]{0} %negate.75), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %subtract.12 = c128[3]{0} subtract(c128[3]{0} %param_0.3, c128[3]{0} %complex.73), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/sub" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.3 (param_0.6: c128[3], param_1.13: c128[3]) -> c128[3] {
  %param_0.6 = c128[3]{0} parameter(0)
  %param_1.13 = c128[3]{0} parameter(1)
  %add.98 = c128[3]{0} add(c128[3]{0} %param_0.6, c128[3]{0} %param_1.13), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.106 = f64[3]{0} real(c128[3]{0} %add.98), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.106 = f64[3]{0} imag(c128[3]{0} %add.98), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.76 = f64[3]{0} negate(f64[3]{0} %imag.106), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %complex.74 = c128[3]{0} complex(f64[3]{0} %real.106, f64[3]{0} %negate.76), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.4 (param_0.7: c128[3], param_1.16: c128[3], param_2.12: c128[], param_3.5: c128[], param_4.8: c128[]) -> c128[3] {
  %param_0.7 = c128[3]{0} parameter(0)
  %param_4.8 = c128[] parameter(4)
  %abs.36 = f64[] abs(c128[] %param_4.8), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %convert.35 = c128[] convert(f64[] %abs.36), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/convert_element_type[new_dtype=complex128 weak_type=False]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.108 = f64[] real(c128[] %convert.35), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.76.clone.4 = c128[] constant((6.6613381477509392e-14, 0))
  %param_3.5 = c128[] parameter(3)
  %multiply.98 = c128[] multiply(c128[] %constant.76.clone.4, c128[] %param_3.5), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.107 = f64[] real(c128[] %multiply.98), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.77 = pred[] compare(f64[] %real.108, f64[] %real.107), direction=EQ, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/eq" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.108 = f64[] imag(c128[] %convert.35), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.107 = f64[] imag(c128[] %multiply.98), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.76 = pred[] compare(f64[] %imag.108, f64[] %imag.107), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.75 = pred[] compare(f64[] %real.108, f64[] %real.107), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %select.28 = pred[] select(pred[] %compare.77, pred[] %compare.76, pred[] %compare.75), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/select_n" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_2.12 = c128[] parameter(2)
  %constant.77.clone.4 = c128[] constant((nan, 0))
  %select.27 = c128[] select(pred[] %select.28, c128[] %param_2.12, c128[] %constant.77.clone.4), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/jit(_where)/select_n" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_misc.py" source_line=18}
  %broadcast.68 = c128[3]{0} broadcast(c128[] %select.27), dimensions={}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_1.16 = c128[3]{0} parameter(1)
  %multiply.97 = c128[3]{0} multiply(c128[3]{0} %broadcast.68, c128[3]{0} %param_1.16), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %add.99 = c128[3]{0} add(c128[3]{0} %param_0.7, c128[3]{0} %multiply.97), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.5 (param_0.9: c128[3], param_1.20: c128[], param_2.17: c128[], param_3.14: c128[]) -> c128[3] {
  %param_3.14 = c128[] parameter(3)
  %abs.37 = f64[] abs(c128[] %param_3.14), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %convert.36 = c128[] convert(f64[] %abs.37), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/convert_element_type[new_dtype=complex128 weak_type=False]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.110 = f64[] real(c128[] %convert.36), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.76.clone.5 = c128[] constant((6.6613381477509392e-14, 0))
  %param_2.17 = c128[] parameter(2)
  %multiply.100 = c128[] multiply(c128[] %constant.76.clone.5, c128[] %param_2.17), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.109 = f64[] real(c128[] %multiply.100), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.80 = pred[] compare(f64[] %real.110, f64[] %real.109), direction=EQ, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/eq" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.110 = f64[] imag(c128[] %convert.36), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.109 = f64[] imag(c128[] %multiply.100), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.79 = pred[] compare(f64[] %imag.110, f64[] %imag.109), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.78 = pred[] compare(f64[] %real.110, f64[] %real.109), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %select.30 = pred[] select(pred[] %compare.80, pred[] %compare.79, pred[] %compare.78), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/select_n" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_1.20 = c128[] parameter(1)
  %constant.77.clone.5 = c128[] constant((nan, 0))
  %select.29 = c128[] select(pred[] %select.30, c128[] %param_1.20, c128[] %constant.77.clone.5), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/jit(_where)/select_n" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_misc.py" source_line=18}
  %broadcast.69 = c128[3]{0} broadcast(c128[] %select.29), dimensions={}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_0.9 = c128[3]{0} parameter(0)
  ROOT %multiply.99 = c128[3]{0} multiply(c128[3]{0} %broadcast.69, c128[3]{0} %param_0.9), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.6 (param_0.11: c128[3], param_1.26: c128[3], param_2.24: c128[3]) -> c128[] {
  %param_2.24 = c128[3]{0} parameter(2)
  %real.112 = f64[3]{0} real(c128[3]{0} %param_2.24), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.112 = f64[3]{0} imag(c128[3]{0} %param_2.24), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.79 = f64[3]{0} negate(f64[3]{0} %imag.112), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.76 = c128[3]{0} complex(f64[3]{0} %real.112, f64[3]{0} %negate.79), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_1.26 = c128[3]{0} parameter(1)
  %constant.57..sunk.4 = c128[3]{0} constant({(1.8662642516361887, -1.0711323052056121), (0.26333651876420233, -2.397191531077155), (-1.1171098790664813, 1.0158783792828929)})
  %multiply.101 = c128[3]{0} multiply(c128[3]{0} %param_1.26, c128[3]{0} %constant.57..sunk.4), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %param_0.11 = c128[3]{0} parameter(0)
  %add.100 = c128[3]{0} add(c128[3]{0} %multiply.101, c128[3]{0} %param_0.11), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add_any" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.111 = f64[3]{0} real(c128[3]{0} %add.100), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.111 = f64[3]{0} imag(c128[3]{0} %add.100), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.78 = f64[3]{0} negate(f64[3]{0} %imag.111), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.75 = c128[3]{0} complex(f64[3]{0} %real.111, f64[3]{0} %negate.78), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %dot.121 = c128[] dot(c128[3]{0} %complex.76, c128[3]{0} %complex.75), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.7 (param_0.14: c128[3], param_1.30: c128[3]) -> c128[3] {
  %param_0.14 = c128[3]{0} parameter(0)
  %param_1.30 = c128[3]{0} parameter(1)
  %add.101 = c128[3]{0} add(c128[3]{0} %param_0.14, c128[3]{0} %param_1.30), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.113 = f64[3]{0} real(c128[3]{0} %add.101), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.113 = f64[3]{0} imag(c128[3]{0} %add.101), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.80 = f64[3]{0} negate(f64[3]{0} %imag.113), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %complex.77 = c128[3]{0} complex(f64[3]{0} %real.113, f64[3]{0} %negate.80), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%wide.region_0.8.clone.clone.clone (wide.arg_tuple.10: (c128[3], c128[3], c128[3], c128[3], c128[], /*index=5*/s64[], f64[3], c128[3])) -> (c128[3], c128[3], c128[3], c128[3], c128[], /*index=5*/s64[], f64[3], c128[3]) {
  %wide.arg_tuple.10 = (c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) parameter(0)
  %get-tuple-element.390 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=3
  %copy.9 = c128[3]{0} copy(c128[3]{0} %get-tuple-element.390)
  %get-tuple-element.391 = c128[] get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=4
  %copy.10 = c128[] copy(c128[] %get-tuple-element.391)
  %constant.58..sunk.2 = c128[3,3]{1,0} constant({ { (-3.4683985041370184, 0.2818515524340488), (-2.0531999581789173, 0.76532647668268594), (5.269823805569831, 3.5613196166646359) }, { (-2.559036532612764, -0.3698252257987209), (-0.25420681272147494, -1.8022993744788929), (1.667097371428415, 2.7456472301998929) }, { (1.3575242846983384, -4.1063133419096447), (1.4836047923312523, -1.9767224256595632), (-6.86256834124183, -0.81498779940376331) } })
  %dot.100 = c128[3]{0} dot(c128[3,3]{1,0} %constant.58..sunk.2, c128[3]{0} %copy.9), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((1,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %constant.7..sunk.6 = c128[3,3]{1,0} constant({ { (-0.35961650795202704, -0.3574244167201307), (0.16636708257665359, 0.13263255633488857), (1.27318783450939, 0.88189620886301057) }, { (0.35700332955161357, 0.18796015296329902), (-0.837553199539162, -0.78027940540578256), (0.20127147836679504, 0.60223804844342244) }, { (0.58774655732207071, 0.46419954874803704), (0.094338355650602168, -0.28282809935266839), (0.73162017785689926, -0.0642288464334354) } })
  %constant.57..sunk.2 = c128[3]{0} constant({(1.8662642516361887, -1.0711323052056121), (0.26333651876420233, -2.397191531077155), (-1.1171098790664813, 1.0158783792828929)})
  %multiply.79 = c128[3]{0} multiply(c128[3]{0} %copy.9, c128[3]{0} %constant.57..sunk.2), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %dot.101 = c128[3]{0} dot(c128[3,3]{1,0} %constant.7..sunk.6, c128[3]{0} %multiply.79), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((1,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %fusion.7 = c128[3]{0} fusion(c128[3]{0} %dot.100, c128[3]{0} %dot.101), kind=kLoop, calls=%fused_computation.7, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %dot.103 = c128[3]{0} dot(c128[3]{0} %fusion.7, c128[3,3]{1,0} %constant.58..sunk.2), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %dot.102 = c128[3]{0} dot(c128[3]{0} %fusion.7, c128[3,3]{1,0} %constant.7..sunk.6), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %fusion.6 = c128[] fusion(c128[3]{0} %dot.103, c128[3]{0} %dot.102, c128[3]{0} %copy.9), kind=kLoop, calls=%fused_computation.6, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %divide.26 = c128[] divide(c128[] %copy.10, c128[] %fusion.6), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/div" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %fusion.5 = c128[3]{0} fusion(c128[3]{0} %copy.9, c128[] %divide.26, c128[] %copy.10, c128[] %fusion.6), kind=kLoop, calls=%fused_computation.5, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %get-tuple-element.388 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=1
  %fusion.4 = c128[3]{0} fusion(c128[3]{0} %get-tuple-element.388, c128[3]{0} %copy.9, c128[] %divide.26, c128[] %copy.10, c128[] %fusion.6), kind=kLoop, calls=%fused_computation.4, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %get-tuple-element.413 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=7
  %dot.105 = c128[3]{0} dot(c128[3,3]{1,0} %constant.58..sunk.2, c128[3]{0} %fusion.4), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((1,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %multiply.83 = c128[3]{0} multiply(c128[3]{0} %fusion.4, c128[3]{0} %constant.57..sunk.2), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %dot.106 = c128[3]{0} dot(c128[3,3]{1,0} %constant.7..sunk.6, c128[3]{0} %multiply.83), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((1,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %fusion.3 = c128[3]{0} fusion(c128[3]{0} %dot.105, c128[3]{0} %dot.106), kind=kLoop, calls=%fused_computation.3, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %dot.108 = c128[3]{0} dot(c128[3]{0} %fusion.3, c128[3,3]{1,0} %constant.58..sunk.2), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %dot.107 = c128[3]{0} dot(c128[3]{0} %fusion.3, c128[3,3]{1,0} %constant.7..sunk.6), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %fusion.2 = c128[3]{0} fusion(c128[3]{0} %get-tuple-element.413, c128[3]{0} %dot.108, c128[3]{0} %dot.107), kind=kLoop, calls=%fused_computation.2, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/sub" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %fusion.1 = c128[] fusion(c128[3]{0} %fusion.2), kind=kLoop, calls=%fused_computation.1, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %divide.27 = c128[] divide(c128[] %fusion.1, c128[] %copy.10), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/div" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %fusion = c128[3]{0} fusion(c128[3]{0} %fusion.2, c128[3]{0} %copy.9, c128[] %divide.27), kind=kLoop, calls=%fused_computation, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %get-tuple-element.392 = s64[] get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=5
  %constant.156 = s64[] constant(1)
  %add.86 = s64[] add(s64[] %get-tuple-element.392, s64[] %constant.156), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %get-tuple-element.401 = f64[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.10), index=6
  ROOT %tuple.35 = (c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) tuple(c128[3]{0} %fusion.5, c128[3]{0} %fusion.4, c128[3]{0} %fusion.2, c128[3]{0} %fusion, c128[] %fusion.1, /*index=5*/s64[] %add.86, f64[3]{0} %get-tuple-element.401, c128[3]{0} %get-tuple-element.413)
}

%region_3.94 (Arg_0.95: f64[], Arg_1.96: f64[]) -> f64[] {
  %Arg_0.95 = f64[] parameter(0)
  %Arg_1.96 = f64[] parameter(1)
  ROOT %maximum.97 = f64[] maximum(f64[] %Arg_0.95, f64[] %Arg_1.96), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/reduce_max[axes=(0,)]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%region_2.90 (Arg_0.91: f64[], Arg_1.92: f64[]) -> f64[] {
  %Arg_0.91 = f64[] parameter(0)
  %Arg_1.92 = f64[] parameter(1)
  ROOT %maximum.93 = f64[] maximum(f64[] %Arg_0.91, f64[] %Arg_1.92), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/reduce_max[axes=(0,)]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.8 (param_0.16: c128[3], param_1.36: c128[3], param_2.31: c128[3], param_3.27: f64[3], param_4.25: s64[], param_5.23: c128[]) -> pred[] {
  %param_5.23 = c128[] parameter(5)
  %real.114 = f64[] real(c128[] %param_5.23), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.171 = f64[] constant(0)
  %compare.86 = pred[] compare(f64[] %real.114, f64[] %constant.171), direction=EQ, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/eq" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.114 = f64[] imag(c128[] %param_5.23), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.85 = pred[] compare(f64[] %imag.114, f64[] %constant.171), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.84 = pred[] compare(f64[] %real.114, f64[] %constant.171), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %select.31 = pred[] select(pred[] %compare.86, pred[] %compare.85, pred[] %compare.84), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/select_n" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_4.25 = s64[] parameter(4)
  %constant.170 = s64[] constant(30)
  %compare.83 = pred[] compare(s64[] %param_4.25, s64[] %constant.170), direction=LT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/lt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %and.17 = pred[] and(pred[] %select.31, pred[] %compare.83), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/and" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_2.31 = c128[3]{0} parameter(2)
  %param_3.27 = f64[3]{0} parameter(3)
  %convert.38 = c128[3]{0} convert(f64[3]{0} %param_3.27), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/convert_element_type[new_dtype=complex128 weak_type=False]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %divide.33 = c128[3]{0} divide(c128[3]{0} %param_2.31, c128[3]{0} %convert.38), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/div" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %abs.40 = f64[3]{0} abs(c128[3]{0} %divide.33), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.169 = f64[] constant(-inf)
  %reduce.17 = f64[] reduce(f64[3]{0} %abs.40, f64[] %constant.169), dimensions={0}, to_apply=%region_2.90, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/reduce_max[axes=(0,)]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.168 = f64[] constant(1)
  %compare.82 = pred[] compare(f64[] %reduce.17, f64[] %constant.168), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_0.16 = c128[3]{0} parameter(0)
  %param_1.36 = c128[3]{0} parameter(1)
  %abs.39 = f64[3]{0} abs(c128[3]{0} %param_1.36), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.167 = f64[] constant(1e-12)
  %broadcast.70 = f64[3]{0} broadcast(f64[] %constant.167), dimensions={}
  %multiply.102 = f64[3]{0} multiply(f64[3]{0} %abs.39, f64[3]{0} %broadcast.70), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %add.102 = f64[3]{0} add(f64[3]{0} %multiply.102, f64[3]{0} %broadcast.70), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %convert.37 = c128[3]{0} convert(f64[3]{0} %add.102), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/convert_element_type[new_dtype=complex128 weak_type=False]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %divide.32 = c128[3]{0} divide(c128[3]{0} %param_0.16, c128[3]{0} %convert.37), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/div" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %abs.38 = f64[3]{0} abs(c128[3]{0} %divide.32), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %reduce.16 = f64[] reduce(f64[3]{0} %abs.38, f64[] %constant.169), dimensions={0}, to_apply=%region_3.94, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/reduce_max[axes=(0,)]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.81 = pred[] compare(f64[] %reduce.16, f64[] %constant.168), direction=GT, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/gt" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %or.8 = pred[] or(pred[] %compare.82, pred[] %compare.81), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/or" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %and.16 = pred[] and(pred[] %and.17, pred[] %or.8), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/and" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%wide.region_1.98.clone.clone.clone (wide.arg_tuple.8: (c128[3], c128[3], c128[3], c128[3], c128[], /*index=5*/s64[], f64[3], c128[3])) -> pred[] {
  %wide.arg_tuple.8 = (c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) parameter(0)
  %get-tuple-element.316 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=0
  %get-tuple-element.317 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=1
  %get-tuple-element.318 = c128[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=2
  %get-tuple-element.321 = f64[3]{0} get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=6
  %get-tuple-element.320 = s64[] get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=5
  %get-tuple-element.319 = c128[] get-tuple-element((c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[], /*index=5*/s64[], f64[3]{0}, c128[3]{0}) %wide.arg_tuple.8), index=4
  ROOT %fusion.8 = pred[] fusion(c128[3]{0} %get-tuple-element.316, c128[3]{0} %get-tuple-element.317, c128[3]{0} %get-tuple-element.318, f64[3]{0} %get-tuple-element.321, s64[] %get-tuple-element.320, /*index=5*/c128[] %get-tuple-element.319), kind=kLoop, calls=%fused_computation.8, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/cond/and" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.9 (param_0.17: c128[3], param_1.39: c128[3], param_2.33: c128[]) -> c128[3] {
  %param_0.17 = c128[3]{0} parameter(0)
  %param_2.33 = c128[] parameter(2)
  %broadcast.71 = c128[3]{0} broadcast(c128[] %param_2.33), dimensions={}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %param_1.39 = c128[3]{0} parameter(1)
  %multiply.103 = c128[3]{0} multiply(c128[3]{0} %broadcast.71, c128[3]{0} %param_1.39), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %add.103 = c128[3]{0} add(c128[3]{0} %param_0.17, c128[3]{0} %multiply.103), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.10 (param_0.19: c128[3]) -> c128[] {
  %param_0.19 = c128[3]{0} parameter(0)
  %real.115 = f64[3]{0} real(c128[3]{0} %param_0.19), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.115 = f64[3]{0} imag(c128[3]{0} %param_0.19), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.81 = f64[3]{0} negate(f64[3]{0} %imag.115), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.79 = c128[3]{0} complex(f64[3]{0} %real.115, f64[3]{0} %negate.81), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %dot.122 = c128[] dot(c128[3]{0} %complex.79, c128[3]{0} %param_0.19), lhs_contracting_dims={0}, rhs_contracting_dims={0}, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/dot_general[dimension_numbers=(((0,), (0,)), ((), ())) precision=None preferred_element_type=complex128]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.11 (param_0.20: c128[3], param_1.46: c128[3], param_2.40: c128[3]) -> c128[3] {
  %param_0.20 = c128[3]{0} parameter(0)
  %param_2.40 = c128[3]{0} parameter(2)
  %constant.78..sunk.3 = c128[3]{0} constant({(1.8662642516361887, -1.0711323052056121), (0.26333651876420233, -2.397191531077155), (-1.1171098790664813, 1.0158783792828929)})
  %multiply.104 = c128[3]{0} multiply(c128[3]{0} %param_2.40, c128[3]{0} %constant.78..sunk.3), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %param_1.46 = c128[3]{0} parameter(1)
  %add.104 = c128[3]{0} add(c128[3]{0} %multiply.104, c128[3]{0} %param_1.46), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add_any" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.116 = f64[3]{0} real(c128[3]{0} %add.104), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.116 = f64[3]{0} imag(c128[3]{0} %add.104), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.83 = f64[3]{0} negate(f64[3]{0} %imag.116), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %complex.80 = c128[3]{0} complex(f64[3]{0} %real.116, f64[3]{0} %negate.83), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %subtract.13 = c128[3]{0} subtract(c128[3]{0} %param_0.20, c128[3]{0} %complex.80), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/sub" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.12 (param_0.23: c128[3], param_1.50: c128[3]) -> c128[3] {
  %param_0.23 = c128[3]{0} parameter(0)
  %param_1.50 = c128[3]{0} parameter(1)
  %add.105 = c128[3]{0} add(c128[3]{0} %param_0.23, c128[3]{0} %param_1.50), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/add" source_file="/home/evgeny/PycharmProjects/lineax_bug_mwe/tests/bug_helpers.py" source_line=20}
  %real.119 = f64[3]{0} real(c128[3]{0} %add.105), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %imag.117 = f64[3]{0} imag(c128[3]{0} %add.105), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/imag" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %negate.84 = f64[3]{0} negate(f64[3]{0} %imag.117), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/neg" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  ROOT %complex.81 = c128[3]{0} complex(f64[3]{0} %real.119, f64[3]{0} %negate.84), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/complex" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
}

%fused_computation.13 (param_0.24: c128[3], param_1.53: c128[3], param_2.44: c128[], param_3.33: c128[], param_4.34: c128[]) -> c128[3] {
  %param_0.24 = c128[3]{0} parameter(0)
  %param_4.34 = c128[] parameter(4)
  %abs.41 = f64[] abs(c128[] %param_4.34), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/abs" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %convert.39 = c128[] convert(f64[] %abs.41), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/convert_element_type[new_dtype=complex128 weak_type=False]" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.121 = f64[] real(c128[] %convert.39), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %constant.97.clone.4 = c128[] constant((6.6613381477509392e-14, 0))
  %param_3.33 = c128[] parameter(3)
  %multiply.106 = c128[] multiply(c128[] %constant.97.clone.4, c128[] %param_3.33), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/mul" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %real.120 = f64[] real(c128[] %multiply.106), metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/real" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
  %compare.89 = pred[] compare(f64[] %real.121, f64[] %real.120), direction=EQ, metadata={op_name="jit(<lambda>)/jit(main)/jit(<lambda>)/jvp(jit(linear_solve))/while/body/eq" source_file="/home/evgeny/.local/lib/python3.11/site-packages/equinox/internal/_primitive.py" source_line=264}
